       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBPROG.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY COMMON.

       PROCEDURE DIVISION.
       SUB-PARAGRAPH.
           DISPLAY "Subprogram called successfully"
           GOBACK.
